examples/openfoam2206/emptyFetch/kOmegaSST_F1blend/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{

    inlet
    {
        type            OmegaABL;
        #include        "include/ABLConditions"
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    ground
    {       
        type            omegaRoughABL;
        #include        "include/ABLConditions"

        z0              uniform $z0;
        ustar           uniform $ustar;
        
        A               uniform $A;
        B               uniform $B;
        C               uniform $C;
        D               uniform $D;
        Etke            uniform $E;

        CmuMax          uniform $CmuMax;
        WFCmu           uniform $WFCmu;

        blendCoeff      uniform $blendCoeff;
        zDir            uniform $zDir;

        thresholdU      uniform $thresholdU;
        thresholdE      uniform $thresholdE;
        thresholdK      uniform $thresholdK;
        thresholdO      uniform $thresholdO;

        constantU       uniform $constantU;
        constantE       uniform $constantE;
        constantK       uniform $constantK;
        constantO       uniform $constantO;

        betaStarMax     uniform $betaStarMax;
        WFbetaStar      uniform $WFbetaStar;

        roughWall       uniform 1;
        kappaWF         uniform $kappa;

        value           $internalField;
    }

    #include "include/sideAndTopPatches"

}

// ************************************************************************* //
